run/tutorials/incompressible/pimpleFoam/RAS/TJunctionFan/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

fields true;

baffles
{
    baffleFaces
    {
        type        faceZone;
        zoneName    baffleFaces;

        owner
        {
            name        baffle0;
            type        wall;

            patchFields
            {
                epsilon
                {
                    type        epsilonWallFunction;
                    Cmu         0.09;
                    kappa       0.41;
                    E           9.8;
                    value       uniform 0;
                }
                k
                {
                    type        kqRWallFunction;
                    value       uniform 0;
                }
                nut
                {
                    type        nutkWallFunction;
                    Cmu         0.09;
                    kappa       0.41;
                    E           9.8;
                    value       uniform 0;
                }
                nuTilda
                {
                    type        zeroGradient;
                }
                p
                {
                    type        zeroGradient;
                }
                U
                {
                    type        fixedValue;
                    value       uniform (0 0 0);
                }
            }
        }

        neighbour
        {
            name        baffle1;
            type        wall;

            patchFields
            {
                $../../owner/patchFields;
            }
        }
    }

    cyclicFaces
    {
        type        searchableSurface;
        surface     searchablePlate;
        origin      (0.099 -0.006 0.004);
        span        (0 0.012 0.012);

        owner
        {
            name        cyclic0;
            type        cyclic;
            neighbourPatch cyclic1;

            patchFields
            {
                p
                {
                    type        fanPressureJump;
                    patchType   cyclic;
                    jump        uniform 0;
                    value       uniform 0;
                    jumpTable   polynomial 1((100 0));
                }
            }
        }

        neighbour
        {
            name        cyclic1;
            type        cyclic;
            neighbourPatch cyclic0;

            patchFields
            {
                $../../owner/patchFields;
            }
        }
    }
}


// ************************************************************************* //
